{
  "navbar": {
    "paused": "PAUSED",
    "actions": "ACTIONS",
    "config": "CONFIGURATION",
    "contact": "CONTACT",
    "yes": "YES",
    "no": "NO",
    "youWin": "You found all! Congrats!",
    "findCharacters": "Can you find the characters hidden in the words?",
    "closeModal": "Close",
    "newCharacterUnlocked": "New character unlocked!",
    "downloadCV": "DOWNLOAD CV",
    "playGame": "MINIGAME"
  },
  "presentation": {
    "fullstackDeveloper": "Fullstack Developer",
    "versatileDeveloper": "Versatile Developer, ",
    "creativeProgrammer": "creative programmer"
  },
  "technologies": {
    "title": "Technologies",
    "hardSkills": {
      "title": "Hard skills",
      "frontend": "Frontend: HTML/CSS, JavaScript, TypeScript, ReactJS, Redux, Zustand",
      "backend": "Backend: NodeJS, ExpressJS, MongoDB",
      "cloudDevOps": "Cloud & DevOps: AWS, Serverless Architecture, Docker",
      "tools": "Tools: Trello, Jira, Slack, Postman, Git",
      "methodologies": "Methodologies: Scrum/Agile/Kanban"
    },
    "softSkills": {
      "title": "Soft skills",
      "creative": "Creativity",
      "teamwork": "Teamwork",
      "problemSolving": "Problem solving",
      "criticalThinking": "Critical thinking",
      "adaptability": "Adaptability",
      "communication": "Communication",
      "timeManagement": "Time management",
      "initiative": "Initiative"
    }
  },
  "professionalExperience": {
    "title": "Professional Experience",
    "instructor": {
      "jobTitle": "Web Development Instructor - Instituto NOA",
      "date": "October 2024 - Present",
      "jobDescription": "Teach foundational and intermediate web development skills, including HTML, CSS, JavaScript and Node.js. Create educational materials, guide students through practical projects, and foster best practices in web development for real-world applications.",
      "firstResponsibility": "Develop practical activities that reinforce the learning and application of HTML, CSS, and JavaScript.",
      "secondResponsibility": "Guide students in building complete web applications, reinforcing core programming concepts and project-based learning.",
      "thirdResponsibility": "Provide individualized feedback and mentorship, improving student performance and project quality."
    },
    "appsnube": {
      "jobTitle": "Fullstack Developer - Appsnube",
      "date": "November 2024 - June 2025",
      "jobDescription": "Developed and maintained e-commerce applications integrated with the Tiendanube platform. Worked across the full stack using a serverless architecture on AWS and modern frontend technologies. Responsible for technical support, implementation of new features, and bug fixing to ensure seamless performance of applications used by multiple online stores.",
      "firstResponsibility": "Implemented new features across multiple applications, improving user experience and reducing client support requests.",
      "secondResponsibility": "Optimized backend services using AWS Lambda and DynamoDB, resulting in faster response times and lower infrastructure costs.",
      "thirdResponsibility": "Resolved critical bugs in production systems, ensuring consistent uptime and improved stability for end users."
    },
    "freelance": {
      "jobTitle": "Freelance Web Developer",
      "date": "April 2024 - June 2024",
      "jobDescription": "Developed a responsive website for a beauty studio client, focusing on user experience and SEO. Achieved first place in search results for 'Estudio Mimarte.'",
      "firstResponsibility": "Developed and deployed a responsive website to enhance client visibility.",
      "secondResponsibility": "Implemented SEO strategies, achieving top search rankings.",
      "thirdResponsibility": "Collaborated closely with the client to meet design and functionality needs."
    },
    "tutor": {
      "jobTitle": "Private Tutor",
      "date": "February 2024 - April 2024",
      "jobDescription": "Provided personalized tutoring for students in web development, enhancing their understanding and application of coding concepts, which led to improved academic performance.",
      "firstResponsibility": "Created lesson plans covering CSS, React basics, Material UI, Redux Toolkit, Node.js, Express, MongoDB.",
      "secondResponsibility": "Helped students build their own projects to solidify their understanding.",
      "thirdResponsibility": "Provided continuous feedback on their progress and code, helping them troubleshoot and refine their skills."
    }
  },
  "aboutMe": {
    "title": "About Me",
    "firstDescription": "I'm a full stack developer with a strong passion for design, technology, and everything with a retro soul. My portfolio reflects my love for 8-bit graphics and interactive experiences that spark ",
    "secondDescription": "In my free time, I enjoy creating 2D games using Godot, blending code, pixel art and creativity. I'm always exploring new tools and learning something new, because I believe growing as a developer is a game that never ends."
  },
  "proyects": {
    "title": "Project",
    "pokedex": "A Pokémon-inspired card game built with React, Redux Toolkit, and Phaser. It features collectible mechanics, dynamic rendering, and MongoDB integration for storing user data and card collections.",
    "restaurantProject": "A full-stack restaurant template built with the MERN stack. Designed as a teaching tool to demonstrate backend integration, dynamic routes, and responsive layouts using real-world examples.",
    "clickMarket": "E-Commerce with the MERN stack featuring user registration and login, shopping cart, favorite products, CRUD operations for users and products, and a simulated purchase with Stripe.",
    "mimArte": "A custom-made website for a beauty salon, featuring responsive design, service listings, and booking options. Tailored to meet the visual identity and specific needs of the client.",
    "vangaMovies": "Responsive movie blog built with HTML, CSS, and Bootstrap. Showcases a simple yet elegant layout, grid-based sections for reviews, and adaptability across mobile and desktop devices.",
    "soundStream": "Music web app built with vanilla HTML, CSS, and JavaScript. Features user registration, login, CRUD functionality, song filtering, and an embedded audio player for playback.",
    "chickenAdventure": "2D platformer built in Godot using pixel-art assets. Currently in development with multiple levels and increasing difficulty. Designed as a creative space to test game mechanics.",
    "rollingGame": "Small promotional game developed in Godot for RollingCode-related platforms. Created to be embedded on websites, combining marketing and interactivity in a lightweight format."
  },
  "certifications": {
    "title": "ertificates",
    "fullstack": "Full Stack Web Developer in RollingCode School",
    "english": "EFSET English Certificate (B2 Upper Intermediate)",
    "scrum": "Scrum Fundamentals Certified (SFC)",
    "html": "HTML and CSS (OpenBootCamp)",
    "intro": "Introduction to Programming (OpenBootCamp)",
    "basics": "Basic Concepts of Programming (OpenBootCamp)",
    "js": "1st place JS 1.0 Tournament",
    "jsParticipation": "JS 1.0 Participation Certificate",
    "codingClashWinner": "Coding Clash Tournament Winner"
  },
  "contact": {
    "title": "Contact me",
    "email": "Email",
    "subject": "Subject",
    "message": "Message",
    "send": "Send"
  }
}
