{
  "navbar": {
    "paused": "PAUSA",
    "actions": "ACCIONES",
    "config": "CONFIGURACIÓN",
    "contact": "CONTACTO",
    "yes": "SI",
    "no": "NO",
    "youWin": "Encontraste a todos! Felicidades!",
    "findCharacters": "¿Podés encontrar los personajes escondidos en las palabras?",
    "closeModal": "Cerrar",
    "newCharacterUnlocked": "Nuevo personaje desbloqueado!",
    "downloadCV": "DESCARGAR CV",
    "playGame": "MINIJUEGO"
  },
  "presentation": {
    "fullstackDeveloper": "Desarrollador Fullstack",
    "versatileDeveloper": "Desarrollador versátil, ",
    "creativeProgrammer": "programador creativo"
  },
  "technologies": {
    "title": "Tecnologías",
    "hardSkills": {
      "title": "Habilidades técnicas",
      "frontend": "Frontend: HTML/CSS, JavaScript, TypeScript, ReactJS, Redux, Zustand",
      "backend": "Backend: NodeJS, ExpressJS, MongoDB",
      "cloudDevOps": "Cloud & DevOps: AWS, Arquitectura Serverless, Docker",
      "tools": "Herramientas: Trello, Jira, Slack, Postman, Git",
      "methodologies": "Metodologías: Scrum/Ágil/Kanban"
    },
    "softSkills": {
      "title": "Habilidades blandas",
      "creative": "Creatividad",
      "teamwork": "Trabajo en equipo",
      "problemSolving": "Resolución de problemas",
      "criticalThinking": "Pensamiento crítico",
      "adaptability": "Adaptabilidad",
      "communication": "Comunicación",
      "timeManagement": "Gestión del tiempo",
      "initiative": "Iniciativa"
    }
  },
  "aboutMe": {
    "title": "Sobre mí",
    "firstDescription": "Soy un desarrollador full stack con una fuerte inclinación por el diseño, la tecnología y todo lo que tenga esencia retro. Mi portafolio refleja mi fascinación por los gráficos de 8 bits y las experiencias interactivas que despiertan ",
    "secondDescription": "En mi tiempo libre, me gusta crear videojuegos en 2D usando Godot, combinando código, diseño pixelado y creatividad. Siempre estoy explorando nuevas herramientas y aprendiendo algo nuevo, porque creo que crecer como desarrollador es un juego que nunca se termina."
  },
  "professionalExperience": {
    "title": "Experiencia Profesional",
    "ada": {
      "jobTitle": "Instructor de Frontend - ADA ITW",
      "date": "Julio 2025 - Actualidad",
      "jobDescription": "Diseño e imparto clases enfocadas en desarrollo web moderno en una ONG que busca reducir la brecha de género en tecnología. Promuevo la inclusión, el aprendizaje práctico y la autonomía de las estudiantes, contribuyendo a un entorno de formación accesible y colaborativo.",
      "firstResponsibility": "Dicto cursos de desarrollo frontend a mujeres y diversidades en una ONG sin fines de lucro.",
      "secondResponsibility": "Enseño habilidades prácticas en HTML, CSS, JavaScript y frameworks modernos.",
      "thirdResponsibility": "Adapto los contenidos a las necesidades del grupo y promuevo un entorno colaborativo"
    },
    "instructor": {
      "jobTitle": "Instructor de Desarrollo Web - Instituto NOA",
      "date": "Octubre 2024 - Actualidad",
      "jobDescription": "Enseño habilidades fundamentales de desarrollo web, incluyendo HTML, CSS, JavaScript y Node.js. Creo materiales educativos, guío a los estudiantes en proyectos prácticos y fomento las mejores prácticas en desarrollo web para aplicaciones del mundo real.",
      "firstResponsibility": "Creo ejercicios prácticos y de aplicación que ayudan a los estudiantes en el uso efectivo de HTML, CSS y JavaScript.",
      "secondResponsibility": "Guío a los estudiantes en la creación de aplicaciones web completas, reforzando conceptos clave.",
      "thirdResponsibility": "Brindo retroalimentación personalizada que mejora el rendimiento y la calidad de los proyectos."
    },
    "tutor": {
      "jobTitle": "Tutor Privado - Desarrollo Web",
      "date": "Febrero 2024 - Actualidad",
      "jobDescription": "Proporciono tutorías personalizadas a estudiantes en desarrollo web, mejorando su comprensión y aplicación de conceptos de programación, lo que contribuye a un mejor desempeño académico.",
      "firstResponsibility": "Creo planes de lecciones que cubren CSS, fundamentos de React, Material UI, Redux Toolkit, Node.js, Express y MongoDB.",
      "secondResponsibility": "Ayudo a los estudiantes a construir sus propios proyectos para consolidar su comprensión.",
      "thirdResponsibility": "Proporciono feedback continuo sobre su progreso y código, ayudándolos a solucionar problemas y perfeccionar sus habilidades."
    },
    "appsnube": {
      "jobTitle": "Desarrollador Full Stack - Appsnube",
      "date": "Noviembre 2024 - Junio 2025",
      "jobDescription": "Diseñé, desarrollé y mantuve aplicaciones e-commerce utilizadas por tiendas en la plataforma Tiendanube, trabajando tanto en el frontend con React y TypeScript como en el backend utilizando arquitectura serverless con AWS (Lambda, DynamoDB, S3, CloudWatch, Docker). Me encargué de brindar soporte técnico, implementar nuevas funcionalidades y solucionar errores para asegurar el funcionamiento eficiente y continuo de las aplicaciones en producción.",
      "firstResponsibility": "Implementación de nuevas funcionalidades que mejoraron la experiencia del usuario y redujeron solicitudes de soporte.",
      "secondResponsibility": "Optimización de servicios backend usando AWS Lambda y DynamoDB, mejorando tiempos de respuesta y reduciendo costos.",
      "thirdResponsibility": "Resolución de errores críticos en producción, garantizando estabilidad y disponibilidad continua."
    },
    "freelance": {
      "jobTitle": "Desarrollador Web Freelance",
      "date": "Abril 2024 - Junio 2024",
      "jobDescription": "Desarrollé un sitio web responsive para una clienta de un estudio de belleza, enfocándome en la experiencia del usuario y el SEO. Logré el primer lugar en los resultados de búsqueda para 'Estudio Mimarte.'",
      "firstResponsibility": "Desarrollé y desplegué un sitio web responsive para mejorar la visibilidad del cliente.",
      "secondResponsibility": "Implementé estrategias de SEO, logrando los primeros puestos en los rankings de búsqueda.",
      "thirdResponsibility": "Colaboré estrechamente con la clienta para cumplir con los requisitos de diseño y funcionalidad."
    }
  },
  "proyects": {
    "title": "Proyecto",
    "pokedex": "Juego de cartas coleccionables inspirado en Pokémon, creado con React, Redux Toolkit y Phaser. Incluye mecánicas dinámicas y base de datos en MongoDB para gestionar las cartas y el progreso del jugador.",
    "restaurantProject": "Plantilla de restaurante full stack creada con MERN como recurso educativo. Incluye diseño responsive, rutas dinámicas, panel de administración y ejemplos reales para enseñar buenas prácticas.",
    "clickMarket": "E-commerce con stack MERN que incluye registro e inicio de sesión de usuarios, carrito de compras, productos favoritos, operaciones CRUD para usuarios y productos, y simulación de pago con Stripe.",
    "mimArte": "Sitio web a medida para un salón de belleza, diseñado según el estilo visual de la clienta. Cuenta con diseño responsive, listado de servicios, opciones de reserva y secciones personalizadas.",
    "vangaMovies": "Blog de películas creado con HTML, CSS y Bootstrap. Tiene diseño 100% responsive, estructura clara para reseñas, y maquetado adaptable a dispositivos móviles y de escritorio.",
    "soundStream": "Web de música desarrollada con HTML, CSS y JavaScript. Incluye registro e inicio de sesión, CRUD de canciones, filtrado por nombre y un reproductor de audio integrado para escuchar pistas online.",
    "chickenAdventure": "Plataformero 2D creado con Godot y gráficos pixel art. Aún en desarrollo, incluye niveles de dificultad creciente y sirve como espacio creativo para probar mecánicas y diseño de niveles.",
    "rollingGame": "Mini juego 2D hecho en Godot para promocionar sitios vinculados a RollingCode. Está pensado para usarse como experiencia interactiva embebida en páginas, con enfoque visual y publicitario."
  },
  "certifications": {
    "title": "ertificados",
    "fullstack": "Desarrollador Full Stack en RollingCode School",
    "english": "EFSET Certificado de inglés (B2 Intermedio Superior)",
    "scrum": "Fundamentos de Scrum Certificados (SFC)",
    "html": "HTML y CSS (OpenBootCamp)",
    "intro": "Introducción a la Programación (OpenBootCamp)",
    "basics": "Conceptos Básicos de Programación (OpenBootCamp)",
    "js": "1er lugar Torneo JS 1.0 ",
    "jsParticipation": "Certificado de participación JS 1.0",
    "codingClashWinner": "Ganador Torneo Coding Clash"
  },
  "contact": {
    "title": "Contáctame",
    "email": "Correo electrónico",
    "subject": "Asunto",
    "message": "Mensaje",
    "send": "Enviar"
  }
}